SM_для_EDT/src/InformationRegisters/рарусСостоянияСтрокЗаявокНаСнабжение/рарусСостоянияСтрокЗаявокНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусСостоянияСтрокЗаявокНаСнабжение</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
    </type>
  </resources>
  <resources>
    <name>ПримечаниеКСостоянию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.впЗаявкаНаСнабжение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/Enums/рарусСостоянияЗаявокНаСнабжение/рарусСостоянияЗаявокНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСостоянияЗаявокНаСнабжение</name>
  <comment>rarus PleA ФТ.СНБ.01.01</comment>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноЗаказано</name>
  </enumValues>
  <enumValues>
    <name>Заказано</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоСоСкладаОтправителя</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеКапитаном</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотренииТехническойДирекции</name>
  </enumValues>
  <enumValues>
    <name>УслугиОказаны</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноВыполнено</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/CommonModules/рарусЗаявкаНаСнабжениеСтатусы/Module.bsl
Процедура РассчитатьСостояниеДокумента(ЗаявкаНаСнабжение, Отказ) Экспорт
	
	РассчитатьЗаписатьСостоянияСтрокДокумента(ЗаявкаНаСнабжение);
	
	РассчитатьОбщееСостояниеДокумента(ЗаявкаНаСнабжение);
	
КонецПроцедуры	

Процедура РассчитатьЗаписатьСостоянияСтрокДокумента(ЗаявкаНаСнабжение)

	ПараметрыРасчета = ПолучитьПараметрыРасчета(ЗаявкаНаСнабжение);
	
	ТекущиеСостоянияСтрок = ПолучитьТекущиеСостоянияСтрокДокумента(ЗаявкаНаСнабжение);
	
	ТекущиеСостоянияСтрок.Колонки.Добавить("Состояние", Новый ОписаниеТипов("ПеречислениеСсылка.рарусСостоянияЗаявокНаСнабжение"));
	
	Для Каждого Строка Из ТекущиеСостоянияСтрок цикл
		
		ПереключитьСостояниеПоСтроке(Строка, ПараметрыРасчета);	
		
	КонецЦикла;	
	
	ЗаписатьСостояния(ТекущиеСостоянияСтрок, ЗаявкаНаСнабжение);

КонецПроцедуры

Процедура РассчитатьОбщееСостояниеДокумента(ЗаявкаНаСнабжение)

	//TODO
	
КонецПроцедуры

Процедура ЗаписатьСостояния(ТаблицаСостояний, ЗаявкаНаСнабжение)

	НЗ = РегистрыСведений.рарусСостоянияСтрокЗаявокНаСнабжение.СоздатьНаборЗаписей();
	НЗ.Отбор.Заказ.Установить(ЗаявкаНаСнабжение);
	НЗ.Загрузить(ТаблицаСостояний);
	НЗ.Записать();

КонецПроцедуры

Функция ПолучитьПредставлениеСостояния(Состояние) Экспорт
	
	Если Состояние = СостояниеНачальное() тогда
		Возврат СостояниеНачальноеПредставление();
	КонецЕсли;
	
	Возврат Строка(Состояние);
	
КонецФункции

#Область РасчетСостояний

Процедура ПереключитьСостояниеПоСтроке(Строка, ПараметрыРасчета)
	
	СостояниеТекущее = Строка.СостояниеТекущее;
	
	Если Не МожноПереключатьСостояние(СостояниеТекущее)	тогда
		Строка.Состояние = СостояниеТекущее;
		Возврат;
	КонецЕсли;	
	
	Строка.Состояние = РассчитатьСостояние(СостояниеТекущее, ПараметрыРасчета);
	
КонецПроцедуры

Функция РассчитатьСостояние(СостояниеТекущее, ПараметрыРасчета)
	
	СостояниеНовое = СостояниеТекущее;
	
	Если СостояниеТекущее = СостояниеНачальное() тогда
		СостояниеНовое = ПереходИзНачальногоСостояния(ПараметрыРасчета);
	КонецЕсли;	
	
	Возврат СостояниеНовое;
	
КонецФункции

Функция ПереходИзНачальногоСостояния(ПараметрыРасчета)
	
	Возврат СостояниеСогласованиеКапитаном();
	
КонецФункции	

Функция МожноПереключатьСостояние(Состояние)
	
	Возврат Состояние = СостояниеНачальное();		 
	
КонецФункции	

#КонецОбласти 
 
#Область ПараметрыРасчета

Функция ПолучитьПараметрыРасчета(ЗаявкаНаСнабжение)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаСнабжение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впЗаявкаНаСнабжение.Ссылка КАК Заказ,
	|	впЗаявкаНаСнабжение.СтатусСогласования КАК СтатусСогласования,
	|	впЗаявкаНаСнабжение.Ответственный КАК Ответственный,
	|	впЗаявкаНаСнабжение.ОбластьРедактирования КАК ОбластьРедактирования
	|ИЗ
	|	Документ.впЗаявкаНаСнабжение КАК впЗаявкаНаСнабжение
	|ГДЕ
	|	впЗаявкаНаСнабжение.Ссылка = &Ссылка";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);

КонецФункции 

Функция ПолучитьТекущиеСостоянияСтрокДокумента(ЗаявкаНаСнабжение) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаСнабжение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка КАК Заказ,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.КодСтроки КАК КодСтроки,
	|	ЕСТЬNULL(рарусСостоянияСтрокЗаявокНаСнабжение.Состояние, Значение(Перечисление.рарусСостоянияЗаявокНаСнабжение.ПустаяСсылка)) КАК СостояниеТекущее
	|ИЗ
	|	Документ.впЗаявкаНаСнабжение.МатериалыИРаботы КАК впЗаявкаНаСнабжениеМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рарусСостоянияСтрокЗаявокНаСнабжение КАК рарусСостоянияСтрокЗаявокНаСнабжение
	|		ПО впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка = рарусСостоянияСтрокЗаявокНаСнабжение.Заказ
	|			И впЗаявкаНаСнабжениеМатериалыИРаботы.КодСтроки = рарусСостоянияСтрокЗаявокНаСнабжение.КодСтроки
	|ГДЕ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка = &Ссылка";
	
	ТекущиеСтатусыТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат ТекущиеСтатусыТаблица;

КонецФункции 

#КонецОбласти 

#Область Состояния

Функция СостояниеНачальное()
	
	Возврат Перечисления.рарусСостоянияЗаявокНаСнабжение.ПустаяСсылка();

КонецФункции

Функция СостояниеНачальноеПредставление()
	
	Возврат "Черновик";

КонецФункции

Функция СостояниеСогласованиеКапитаном()
	
	Возврат Перечисления.рарусСостоянияЗаявокНаСнабжение.СогласованиеКапитаном;

КонецФункции

#КонецОбласти
